p2000t/M2000/src/allegro/Main.c
  // handle window and menu events
  while ((isNextEvent = al_get_next_event(eventQueue, &event)) || pausePressed) {
    if (Debug && isNextEvent) printf("Allegro display/menu event.type: %i\n", event.type);
#ifdef __APPLE__
    if (isNextEvent) al_clear_keyboard_state(display); //event? -> reset keyboard state
#endif

    if (pausePressed) { // pressing Ctrl-P toggles pause
      al_get_keyboard_state(&kbdstate);
      if (al_key_down(&kbdstate, ALLEGRO_KEY_LCTRL) && al_key_up(&kbdstate, ALLEGRO_KEY_P)) {
        pausePressed = 0;
        al_set_menu_item_flags(menu, SPEED_PAUSE, ALLEGRO_MENU_ITEM_CHECKBOX);
      }
      if (al_key_up(&kbdstate, ALLEGRO_KEY_RIGHT)) {
        break; //advance one frame
      }
    }
    if (!isNextEvent) 
      event.type = 0; //clear event type from last event

    if (event.type == ALLEGRO_EVENT_DISPLAY_FOUND)
      ClearScreen();

    if (event.type == ALLEGRO_EVENT_DISPLAY_CLOSE)  { //window close icon was clicked
      Z80_Running = 0;
      break;
    }

    if (event.type == ALLEGRO_EVENT_MENU_CLICK) {
      switch (event.user.data1) {
        case FILE_INSERT_CASSETTE_ID:
        case FILE_BOOT_CASSETTE_ID:
          OpenCassetteDialog(event.user.data1 == FILE_BOOT_CASSETTE_ID);
          break;
        case FILE_REMOVE_CASSETTE_ID:
          al_destroy_path(currentTapePath);
          currentTapePath = NULL;
          RemoveCassette();
          UpdateWindowTitle();
          break;
        case FILE_INSERT_CARTRIDGE_ID:
          cartridgeChooser = al_create_native_file_dialog(al_path_cstr(userCartridgesPath, PATH_SEPARATOR), _(DIALOG_LOAD_CARTRIDGE), "*.bin", ALLEGRO_FILECHOOSER_FILE_MUST_EXIST);
          if (al_show_native_file_dialog(display, cartridgeChooser) && al_get_native_file_dialog_count(cartridgeChooser) > 0) {
            const char *_filename = al_get_native_file_dialog_path(cartridgeChooser, 0);
#ifdef _WIN32
            f = _wfopen(GetWideFilename(_filename), L"rb");
#else
            f = fopen(_filename, "rb");
#endif
            InsertCartridge(_filename, f);
            refreshPath(&userCartridgesPath, CartName);
          }
          al_destroy_native_file_dialog(cartridgeChooser);
          break;
        case FILE_REMOVE_CARTRIDGE_ID:
          RemoveCartridge();
          break;
        case FILE_RESET_ID:
          Z80_Reset();
          break;
        case FILE_SAVE_SCREENSHOT_ID:
          screenshotChooser = al_create_native_file_dialog(al_path_cstr(userScreenshotsPath, PATH_SEPARATOR), _(DIALOG_SAVE_SCREENSHOT),  "*.png;*.bmp", ALLEGRO_FILECHOOSER_SAVE);
          if (al_show_native_file_dialog(display, screenshotChooser) && al_get_native_file_dialog_count(screenshotChooser) > 0) {
            al_save_bitmap(AppendExtensionIfMissing(al_get_native_file_dialog_path(screenshotChooser, 0), ".png"), al_get_target_bitmap());
            refreshPath(&userScreenshotsPath, al_get_native_file_dialog_path(screenshotChooser, 0));
          }
          al_destroy_native_file_dialog(screenshotChooser);
          break;
        case FILE_LOAD_VIDEORAM_ID:
          vRamLoadChooser = al_create_native_file_dialog(al_path_cstr(userVideoRamDumpsPath, PATH_SEPARATOR), _(DIALOG_LOAD_VRAM),  "*.vram", ALLEGRO_FILECHOOSER_FILE_MUST_EXIST);
          if (al_show_native_file_dialog(display, vRamLoadChooser) && al_get_native_file_dialog_count(vRamLoadChooser) > 0) {
            const char *_filename = al_get_native_file_dialog_path(vRamLoadChooser, 0);
#ifdef _WIN32
            f = _wfopen(GetWideFilename(_filename), L"rb");
#else
            f = fopen(_filename, "rb");
#endif
            if (f != NULL) {
              // for each of the 24 lines, read 40 chars and skip 40 chars
              for (i=0;i<24;i++)
                fread(VRAM + ScrollReg + i*80, 1, 40, f); 
              fclose(f);
              RefreshScreen();
              refreshPath(&userVideoRamDumpsPath, al_get_native_file_dialog_path(vRamLoadChooser, 0));
            } 
          }
          al_destroy_native_file_dialog(vRamLoadChooser);
          break;
        case FILE_SAVE_VIDEORAM_ID:
          vRamSaveChooser = al_create_native_file_dialog(al_path_cstr(userVideoRamDumpsPath, PATH_SEPARATOR), _(DIALOG_SAVE_VRAM),  "*.vram", ALLEGRO_FILECHOOSER_SAVE);
          if (al_show_native_file_dialog(display, vRamSaveChooser) && al_get_native_file_dialog_count(vRamSaveChooser) > 0) {
            SaveVideoRAM(AppendExtensionIfMissing(al_get_native_file_dialog_path(vRamSaveChooser, 0), ".vram"));
            refreshPath(&userVideoRamDumpsPath, al_get_native_file_dialog_path(vRamSaveChooser, 0));
          }
          al_destroy_native_file_dialog(vRamSaveChooser);
          break;
        case FILE_LOAD_STATE_ID:
          stateLoadChooser = al_create_native_file_dialog(al_path_cstr(userSavestatesPath, PATH_SEPARATOR), _(DIALOG_LOAD_STATE),  "*.sav", ALLEGRO_FILECHOOSER_FILE_MUST_EXIST);
          if (al_show_native_file_dialog(display, stateLoadChooser) && al_get_native_file_dialog_count(stateLoadChooser) > 0) {
            LoadState(al_get_native_file_dialog_path(stateLoadChooser, 0), NULL);
            refreshPath(&userSavestatesPath, al_get_native_file_dialog_path(stateLoadChooser, 0));
          }
          al_destroy_native_file_dialog(stateLoadChooser);
          break;
        case FILE_SAVE_STATE_ID:
          stateSaveChooser = al_create_native_file_dialog(al_path_cstr(userSavestatesPath, PATH_SEPARATOR), _(DIALOG_SAVE_STATE),  "*.sav", ALLEGRO_FILECHOOSER_SAVE);
          if (al_show_native_file_dialog(display, stateSaveChooser) && al_get_native_file_dialog_count(stateSaveChooser) > 0) {
            SaveState(AppendExtensionIfMissing(al_get_native_file_dialog_path(stateSaveChooser, 0), ".sav"), NULL);
            refreshPath(&userSavestatesPath, al_get_native_file_dialog_path(stateSaveChooser, 0));
          }
          al_destroy_native_file_dialog(stateSaveChooser);
          break;
        case FILE_EXIT_ID:
          Z80_Running = 0;
          break;
        case SPEED_SYNC:
          Sync = !Sync;
          break;
        case SPEED_PAUSE:
          pausePressed = !pausePressed;
          break;
        case SPEED_10_ID: CpuSpeed=10; goto setSpeed;
        case SPEED_20_ID: CpuSpeed=20; goto setSpeed;
        case SPEED_50_ID: CpuSpeed=50; goto setSpeed;
        case SPEED_100_ID: CpuSpeed=100; goto setSpeed;
        case SPEED_120_ID: CpuSpeed=120; goto setSpeed;
        case SPEED_200_ID: CpuSpeed=200; goto setSpeed;
        case SPEED_500_ID: CpuSpeed=500;
          setSpeed:
          Z80_IPeriod=(2500000*CpuSpeed)/(100*IFreq);
          UpdateCpuSpeedMenu();
          break;
        case FPS_50_ID: case FPS_60_ID:
          IFreq = (event.user.data1 == FPS_50_ID ? 50 : 60);
          if ((IFreq == 50 && CpuSpeed == 120) || (IFreq == 60 && CpuSpeed == 100)) {
            CpuSpeed = 2*IFreq;
            UpdateCpuSpeedMenu();
          } else {
            Z80_IPeriod=(2500000*CpuSpeed)/(100*IFreq);
          }
          al_set_timer_speed(timer, 1.0 / IFreq);
          ResetAudioStream();
          al_set_menu_item_flags(menu, FPS_50_ID, IFreq==50 ? ALLEGRO_MENU_ITEM_CHECKED : ALLEGRO_MENU_ITEM_CHECKBOX);
          al_set_menu_item_flags(menu, FPS_60_ID, IFreq==60 ? ALLEGRO_MENU_ITEM_CHECKED : ALLEGRO_MENU_ITEM_CHECKBOX);
          break;
        case KEYBOARD_POSITIONAL_ID:
        case KEYBOARD_SYMBOLIC_ID:
          keyboardmap = !keyboardmap;
          al_set_menu_item_flags(menu, KEYBOARD_SYMBOLIC_ID, keyboardmap==1 ? ALLEGRO_MENU_ITEM_CHECKED : ALLEGRO_MENU_ITEM_CHECKBOX);
          al_set_menu_item_flags(menu, KEYBOARD_POSITIONAL_ID, keyboardmap==0 ? ALLEGRO_MENU_ITEM_CHECKED : ALLEGRO_MENU_ITEM_CHECKBOX);
          break;
        case KEYBOARD_ZOEK_ID:
          PushKey(72); //LSHIFT
          delayedShiftedKeyPress = 59;
          break;
        case KEYBOARD_START_ID:
          PushKey(72); //LSHIFT
          delayedShiftedKeyPress = 56;
          break;
        case KEYBOARD_STOP_ID:
          PushKey(72); //LSHIFT
          delayedShiftedKeyPress = 16;
          break;
        case KEYBOARD_CLEARCAS_ID:
          PushKey(72); //LSHIFT
          delayedShiftedKeyPress = 51;
          break;
        case HARDWARE_T38_ID: RAMSizeKb=16; goto updateMem;
        case HARDWARE_T54_ID: RAMSizeKb=32; goto updateMem;
        case HARDWARE_T102_ID: RAMSizeKb=80; goto updateMem;
          updateMem:
          InitRAM();
          UpdateMemoryMenu();
          ColdBoot = 1;
          Z80_Reset();
          break;
        case OPTIONS_SOUND_ID:
          soundmode = !soundmode;
          break;
        case OPTIONS_VOLUME_HIGH_ID: mastervolume=10; goto updateVol;
        case OPTIONS_VOLUME_MEDIUM_ID: mastervolume=4; goto updateVol;
        case OPTIONS_VOLUME_LOW_ID: mastervolume=1; 
          updateVol:
          UpdateVolumeMenu();
          break;
        case OPTIONS_AUDIOFILTER_0_ID: audiofilter=0; goto updateAudioFilter;
        case OPTIONS_AUDIOFILTER_1_ID: audiofilter=1; goto updateAudioFilter;
        case OPTIONS_AUDIOFILTER_2_ID: audiofilter=2; goto updateAudioFilter;
          updateAudioFilter:
          UpdateAudioFilterMenu();
          break;
        case OPTIONS_JOYSTICK_ID:
          joymode = !joymode;
          break;
        case OPTIONS_JOYSTICK_MAP_0_ID:
        case OPTIONS_JOYSTICK_MAP_1_ID:
          joymap = !joymap;
          al_set_menu_item_flags(menu, OPTIONS_JOYSTICK_MAP_0_ID, joymap==0 ? ALLEGRO_MENU_ITEM_CHECKED : ALLEGRO_MENU_ITEM_CHECKBOX);
          al_set_menu_item_flags(menu, OPTIONS_JOYSTICK_MAP_1_ID, joymap==1 ? ALLEGRO_MENU_ITEM_CHECKED : ALLEGRO_MENU_ITEM_CHECKBOX);
          break;
        case OPTIONS_ENGLISH_ID:
        case OPTIONS_NEDERLANDS_ID:
          uilanguage = event.user.data1 - OPTIONS_ENGLISH_ID;
          al_set_menu_item_flags(menu, OPTIONS_ENGLISH_ID, uilanguage==0 ? ALLEGRO_MENU_ITEM_CHECKED : ALLEGRO_MENU_ITEM_CHECKBOX);
          al_set_menu_item_flags(menu, OPTIONS_NEDERLANDS_ID, uilanguage==1 ? ALLEGRO_MENU_ITEM_CHECKED : ALLEGRO_MENU_ITEM_CHECKBOX);
          CreateEmulatorMenu();
          ClearScreen();
          break;
        case HELP_ABOUT_ID:
          al_show_native_message_box(display,
            "M2000 - Philips P2000 emulator", "",
            _(HELP_ABOUT_MSG_ID),
            NULL, 0);
          break;
        case DISPLAY_SCANLINES:
          scanlines = !scanlines;
          ClearScreen();
          break;
        case DISPLAY_SMOOTHING:
          smoothing = !smoothing;
          ClearScreen();
          break;
        case DISPLAY_FULLSCREEN:
          ToggleFullscreen();
          break;
        case DISPLAY_WINDOW_640x480: case DISPLAY_WINDOW_960x720: case DISPLAY_WINDOW_1280x960: 
        case DISPLAY_WINDOW_1600x1200: case DISPLAY_WINDOW_1920x1440:
          videomode = event.user.data1 - DISPLAY_WINDOW_MENU;
          UpdateDisplaySettings();
          UpdateViewMenu();
          al_resize_display(display, DisplayWidth + 2* DisplayHBorder, DisplayHeight + 2*DisplayVBorder);
          ClearScreen();
          break;
      }
      if (Z80_Running && !delayedShiftedKeyPress) SaveConfig(); //auto save config
    }
  }

  // Ctrl-1           -  ZOEK key (show cassette index)
  if (al_key_down(&kbdstate, ALLEGRO_KEY_LCTRL) && (al_key_up(&kbdstate, ALLEGRO_KEY_1) || al_key_up(&kbdstate, ALLEGRO_KEY_PAD_1))) {
    PushKey(72); //LSHIFT
    delayedShiftedKeyPress = 59;
  }
  // Ctrl-3           -  START key (start loaded program)
  if (al_key_down(&kbdstate, ALLEGRO_KEY_LCTRL) && (al_key_up(&kbdstate, ALLEGRO_KEY_3) || al_key_up(&kbdstate, ALLEGRO_KEY_PAD_3))) {
    PushKey(72); //LSHIFT
    delayedShiftedKeyPress = 56;
  }
  // Ctrl-.           -  STOP key (pause/halt program)
  if (al_key_down(&kbdstate, ALLEGRO_KEY_LCTRL) && (al_key_up(&kbdstate, ALLEGRO_KEY_FULLSTOP) || al_key_up(&kbdstate, ALLEGRO_KEY_PAD_DELETE))) {
    PushKey(72); //LSHIFT
    delayedShiftedKeyPress = 16;
  }
  // Ctrl-7           -  WIS key (clear cassette)
  if (al_key_down(&kbdstate, ALLEGRO_KEY_LCTRL) && (al_key_up(&kbdstate, ALLEGRO_KEY_7) || al_key_up(&kbdstate, ALLEGRO_KEY_PAD_7))) {
    PushKey(72); //LSHIFT
    delayedShiftedKeyPress = 51;
  }

  // Ctrl-I           -  Insert cassette dialog
  if (al_key_down(&kbdstate, ALLEGRO_KEY_LCTRL) && al_key_up(&kbdstate, ALLEGRO_KEY_I) && al_key_up(&kbdstate, ALLEGRO_KEY_LCTRL))
    OpenCassetteDialog(false);

  // Ctrl-O           -  Boot Cassette dialog
  if (al_key_down(&kbdstate, ALLEGRO_KEY_LCTRL) && al_key_up(&kbdstate, ALLEGRO_KEY_O) && al_key_up(&kbdstate, ALLEGRO_KEY_LCTRL))
    OpenCassetteDialog(true);

  // Ctrl-E           -  Eject current cassette
  if (al_key_down(&kbdstate, ALLEGRO_KEY_LCTRL) && al_key_up(&kbdstate, ALLEGRO_KEY_E)) {
    al_destroy_path(currentTapePath);
    currentTapePath = NULL;
    RemoveCassette();
    UpdateWindowTitle();
  }

