p2000t/M2000/src/allegro/Main.c
  // Ctrl-R           -  Reset P2000
  if (al_key_down(&kbdstate, ALLEGRO_KEY_LCTRL) && al_key_up(&kbdstate, ALLEGRO_KEY_R))
    Z80_Reset();

  // Ctrl-Enter       -  Toggle fullscreen on/off (not supported on Linux)
  if ((al_key_down(&kbdstate, ALLEGRO_KEY_LCTRL) || al_key_down(&kbdstate, ALLEGRO_KEY_ALT)) && al_key_up(&kbdstate, ALLEGRO_KEY_ENTER))
    ToggleFullscreen();

  // Ctrl-L           -  Toggle scanlines on/off
  if (al_key_down(&kbdstate, ALLEGRO_KEY_LCTRL) && al_key_up(&kbdstate, ALLEGRO_KEY_L)) {
    scanlines = !scanlines;
    ClearScreen();
  }

  // Ctrl-Q           -  Quit emulator
  if (al_key_down(&kbdstate, ALLEGRO_KEY_LCTRL) && al_key_up(&kbdstate, ALLEGRO_KEY_Q))
    Z80_Running = 0;

  // Ctrl-C           -  Save current state to file (without dialog)
  if (al_key_down(&kbdstate, ALLEGRO_KEY_LCTRL) && al_key_up(&kbdstate, ALLEGRO_KEY_C)) {
    SaveState(NULL, userSavestatesPath);
    IndicateActionDone();
  }

  // Ctrl-V           -  Load previously saved state (without dialog)
  if (al_key_down(&kbdstate, ALLEGRO_KEY_LCTRL) && al_key_up(&kbdstate, ALLEGRO_KEY_V))
    LoadState(NULL, userSavestatesPath);

  // Ctrl-S           -  Save screenshot to file (without dialog)
  if (al_key_down(&kbdstate, ALLEGRO_KEY_LCTRL) && al_key_up(&kbdstate, ALLEGRO_KEY_S)) {
    static char extension[25];
    time_t now = time(NULL);
    strftime(extension, 25, " %Y-%m-%d %H-%M-%S.png", localtime(&now));
    al_set_path_filename(userScreenshotsPath, currentTapePath ? al_get_path_filename(currentTapePath) : "Screenshot");
    al_set_path_extension(userScreenshotsPath, extension);
    al_save_bitmap(al_path_cstr(userScreenshotsPath, PATH_SEPARATOR), al_get_target_bitmap());
    al_set_path_filename(userScreenshotsPath, NULL);
    IndicateActionDone();
  }

  // Ctrl-D           -  Dump visible video RAM to file (without dialog)
  if (al_key_down(&kbdstate, ALLEGRO_KEY_LCTRL) && al_key_up(&kbdstate, ALLEGRO_KEY_D)) {
    static char extension[26];
    time_t now = time(NULL);
    strftime(extension, 26, " %Y-%m-%d %H-%M-%S.vram", localtime(&now));
    al_set_path_filename(userVideoRamDumpsPath, currentTapePath ? al_get_path_filename(currentTapePath) : "VideoRAM");
    al_set_path_extension(userVideoRamDumpsPath, extension);
    SaveVideoRAM(al_path_cstr(userVideoRamDumpsPath, PATH_SEPARATOR));
    al_set_path_filename(userVideoRamDumpsPath, NULL);
    IndicateActionDone();
  }
  
  // Ctrl-P           -  Toggle pause on/off
  if (al_key_down(&kbdstate, ALLEGRO_KEY_LCTRL) && al_key_up(&kbdstate, ALLEGRO_KEY_P)) {
    pausePressed = !pausePressed;
    al_set_menu_item_flags(menu, SPEED_PAUSE, pausePressed ? ALLEGRO_MENU_ITEM_CHECKED : ALLEGRO_MENU_ITEM_CHECKBOX);
  }

  // Ctrl-M           -  Toggle mute/unmute
  if (al_key_down(&kbdstate, ALLEGRO_KEY_LCTRL) && al_key_up(&kbdstate, ALLEGRO_KEY_M)) {
    soundmode = !soundmode;
    al_set_menu_item_flags(menu, OPTIONS_SOUND_ID, soundmode ? ALLEGRO_MENU_ITEM_CHECKED : ALLEGRO_MENU_ITEM_CHECKBOX);
  }

  // handle joystick
  if (joymode && joyDetected) {
    al_get_joystick_state(joystick, &joyState);
    for (i = 0; i < 5; i++) { // 4 directions and 1 button
      if ((i < 4 && joyState.stick[0].axis[i%2]*(-2.0*(i/2)+1.0) > 0.5) ||
          (i == 4 && joyState.button[0])) {
        PushKey(joyKeyMapping[joymap][i]);
        lastJoyState[i] = 1;
      }
      else {
        if (lastJoyState[i]) ReleaseKey(joyKeyMapping[joymap][i]);
        lastJoyState[i] = 0;
      }
    }
  } 
}

/****************************************************************************/
/*** Pauses a specified ammount of milliseconds                           ***/
/****************************************************************************/
void Pause(int ms) 
{
  al_rest((double)ms / 1000.0);
}

void DrawTileScanlines(int tileX, int tileY) 
{
  float i;
  float vpixel = DisplayTileHeight/30.0;
  ALLEGRO_COLOR evenLineColor = al_map_rgba(0, 0, 0, 50);
  ALLEGRO_COLOR scanlineColor = al_map_rgba(0, 0, 0, 120);
  for (i=DisplayVBorder+tileY*DisplayTileHeight; i<DisplayVBorder+(tileY+1)*DisplayTileHeight; i+=3.0*vpixel)
  {
    al_draw_line(DisplayHBorder + tileX*DisplayTileWidth, i+0.45*vpixel, DisplayHBorder + (tileX+1)*DisplayTileWidth, i+0.45*vpixel, scanlineColor, vpixel);
    al_draw_line(DisplayHBorder + tileX*DisplayTileWidth, i+2.45*vpixel, DisplayHBorder + (tileX+1)*DisplayTileWidth, i+2.45*vpixel, evenLineColor, vpixel);
  }
}

/****************************************************************************/
/*** This function is called by the screen refresh drivers to copy the    ***/
/*** off-screen buffer to the actual display                              ***/
/****************************************************************************/
void PutImage (void)
{
  al_flip_display();
}

/****************************************************************************/
/*** Put a character in the display buffer for P2000T emulation mode      ***/
/****************************************************************************/
void PutChar(int x, int y, int c, int fg, int bg, int si)
{
  int K = c + (fg << 8) + (bg << 16) + (si << 24);
  if (K == OldCharacter[y * 40 + x])
    return;
  OldCharacter[y * 40 + x] = K;

  if (c > 0 && Debug) {
    printf("PutChar (%i,%i,%i,%i,%i,%i);\n", x, y, c, fg, bg, si);
  }

  al_set_target_bitmap(al_get_backbuffer(display));
  al_draw_tinted_scaled_bitmap(
    smoothing ? smFontBuf : FontBuf,
    al_map_rgba(Pal[fg * 3], Pal[fg * 3 + 1], Pal[fg * 3 + 2], 255), 
    c * (CHAR_TILE_WIDTH + CHAR_TILE_SPACE), (si >> 1) * CHAR_TILE_HEIGHT/2, 
    CHAR_TILE_WIDTH, si ? CHAR_TILE_HEIGHT/2 : CHAR_TILE_HEIGHT,
    DisplayHBorder + x * DisplayTileWidth, DisplayVBorder + y * DisplayTileHeight,
    DisplayTileWidth, DisplayTileHeight, 0);
  if (bg)
    al_draw_tinted_scaled_bitmap(
      smoothing ? smFontBuf_bk : FontBuf_bk,
      al_map_rgba(Pal[bg * 3], Pal[bg * 3 + 1], Pal[bg * 3 + 2], 0), 
      c * (CHAR_TILE_WIDTH + CHAR_TILE_SPACE), (si >> 1) * CHAR_TILE_HEIGHT/2, 
      CHAR_TILE_WIDTH, si ? CHAR_TILE_HEIGHT/2 : CHAR_TILE_HEIGHT,
      DisplayHBorder + x * DisplayTileWidth, DisplayVBorder + y * DisplayTileHeight,
      DisplayTileWidth, DisplayTileHeight, 0);
  if (scanlines) DrawTileScanlines(x, y);
}

char *GetResourcesPath() 
{
  strcpy (ProgramPath, al_path_cstr(al_get_standard_path(ALLEGRO_RESOURCES_PATH), PATH_SEPARATOR));

  // debian install check
  if (!strcmp(ProgramPath,"/usr/bin/"))
    strcpy(ProgramPath, "/usr/share/M2000/");

  return ProgramPath;
}

char *GetDocumentsPath() 
{
  strcpy(DocumentPath, GetResourcesPath()); //fallback to program path
  ALLEGRO_PATH *docPath = al_get_standard_path(ALLEGRO_USER_DOCUMENTS_PATH);
  if (docPath) {
    al_append_path_component(docPath, "M2000");
    if (al_make_directory(al_path_cstr(docPath, PATH_SEPARATOR)))
      strcpy(DocumentPath, al_path_cstr(docPath, PATH_SEPARATOR));
    al_destroy_path(docPath);
  }
  return DocumentPath;
}

int main(int argc,char *argv[]) 
{
  if (!al_init()) { ShowErrorMessage("Allegro could not initialize its core."); return EXIT_FAILURE; }
  if (!al_init_primitives_addon()) { ShowErrorMessage("Allegro could not initialize primitives addon."); return EXIT_FAILURE; }
  if (!al_init_image_addon()) { ShowErrorMessage("Allegro could not initialize image addon."); return EXIT_FAILURE; }
  if (!al_init_native_dialog_addon()) { ShowErrorMessage("Allegro could not initialize native dialog addon."); return EXIT_FAILURE; }
  if (!al_install_keyboard()) { ShowErrorMessage("Allegro could not install keyboard."); return EXIT_FAILURE; }

  /* create M2000 folder inside user's Documents folder */
  docPath = al_get_standard_path(ALLEGRO_USER_DOCUMENTS_PATH);
  al_append_path_component(docPath, "M2000");
  if (!al_make_directory(al_path_cstr(docPath, PATH_SEPARATOR))) { 
    ShowErrorMessage("Can't create documents folder %s.", al_path_cstr(docPath, PATH_SEPARATOR)); 
    return EXIT_FAILURE; 
  }

  InitConfig();
  if (Verbose) {
    uint32_t version = al_get_allegro_version();
    printf("Using Allegro libs version %i.%i.%i\n",version >> 24, (version >> 16) & 255, (version >> 8) & 255);
  }
  return M2000_main(argc, argv);
}
